vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/ccl.h
/*
 * Component description for CCL
 *
 * Copyright (c) 2026 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*      file generated from device description file (ATDF) version None       */
#ifndef _PIC32CMPL10_CCL_COMPONENT_H_
#define _PIC32CMPL10_CCL_COMPONENT_H_

#if !defined(DISABLE_CMSIS)
#include "core_cm0plus.h"
#endif /* !defined(DISABLE_CMSIS) */

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR CCL                       */
/* ************************************************************************** */

/* -------- CCL_CTRLA : (CCL Offset: 0x00) (R/W 32) Control A -------- */
#define CCL_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (CCL_CTRLA) Control A  Reset Value */

#define CCL_CTRLA_SWRST_Pos                   _UINT32_(0)                                          /* (CCL_CTRLA) Software Reset Position */
#define CCL_CTRLA_SWRST_Msk                   (_UINT32_(0x1) << CCL_CTRLA_SWRST_Pos)               /* (CCL_CTRLA) Software Reset Mask */
#define CCL_CTRLA_SWRST(value)                (CCL_CTRLA_SWRST_Msk & (_UINT32_(value) << CCL_CTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the CCL_CTRLA register */
#define CCL_CTRLA_ENABLE_Pos                  _UINT32_(1)                                          /* (CCL_CTRLA) Enable Position */
#define CCL_CTRLA_ENABLE_Msk                  (_UINT32_(0x1) << CCL_CTRLA_ENABLE_Pos)              /* (CCL_CTRLA) Enable Mask */
#define CCL_CTRLA_ENABLE(value)               (CCL_CTRLA_ENABLE_Msk & (_UINT32_(value) << CCL_CTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the CCL_CTRLA register */
#define CCL_CTRLA_RUNSTDBY_Pos                _UINT32_(6)                                          /* (CCL_CTRLA) Run in Standby Position */
#define CCL_CTRLA_RUNSTDBY_Msk                (_UINT32_(0x1) << CCL_CTRLA_RUNSTDBY_Pos)            /* (CCL_CTRLA) Run in Standby Mask */
#define CCL_CTRLA_RUNSTDBY(value)             (CCL_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << CCL_CTRLA_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the CCL_CTRLA register */
#define CCL_CTRLA_Msk                         _UINT32_(0x00000043)                                 /* (CCL_CTRLA) Register Mask  */


/* -------- CCL_SEQCTRL : (CCL Offset: 0x04) (R/W 32) Sequential Control -------- */
#define CCL_SEQCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (CCL_SEQCTRL) Sequential Control  Reset Value */

#define CCL_SEQCTRL_SEQSEL0_Pos               _UINT32_(0)                                          /* (CCL_SEQCTRL) Sequential Selection 0 Position */
#define CCL_SEQCTRL_SEQSEL0_Msk               (_UINT32_(0xF) << CCL_SEQCTRL_SEQSEL0_Pos)           /* (CCL_SEQCTRL) Sequential Selection 0 Mask */
#define CCL_SEQCTRL_SEQSEL0(value)            (CCL_SEQCTRL_SEQSEL0_Msk & (_UINT32_(value) << CCL_SEQCTRL_SEQSEL0_Pos)) /* Assignment of value for SEQSEL0 in the CCL_SEQCTRL register */
#define   CCL_SEQCTRL_SEQSEL0_DISABLE_Val     _UINT32_(0x0)                                        /* (CCL_SEQCTRL) Sequential logic is disabled  */
#define   CCL_SEQCTRL_SEQSEL0_DFF_Val         _UINT32_(0x1)                                        /* (CCL_SEQCTRL) D flip-flop  */
#define   CCL_SEQCTRL_SEQSEL0_JK_Val          _UINT32_(0x2)                                        /* (CCL_SEQCTRL) JK flip-flop  */
#define   CCL_SEQCTRL_SEQSEL0_LATCH_Val       _UINT32_(0x3)                                        /* (CCL_SEQCTRL) D latch  */
#define   CCL_SEQCTRL_SEQSEL0_RS_Val          _UINT32_(0x4)                                        /* (CCL_SEQCTRL) RS latch  */
#define CCL_SEQCTRL_SEQSEL0_DISABLE           (CCL_SEQCTRL_SEQSEL0_DISABLE_Val << CCL_SEQCTRL_SEQSEL0_Pos) /* (CCL_SEQCTRL) Sequential logic is disabled Position */
#define CCL_SEQCTRL_SEQSEL0_DFF               (CCL_SEQCTRL_SEQSEL0_DFF_Val << CCL_SEQCTRL_SEQSEL0_Pos) /* (CCL_SEQCTRL) D flip-flop Position */
#define CCL_SEQCTRL_SEQSEL0_JK                (CCL_SEQCTRL_SEQSEL0_JK_Val << CCL_SEQCTRL_SEQSEL0_Pos) /* (CCL_SEQCTRL) JK flip-flop Position */
#define CCL_SEQCTRL_SEQSEL0_LATCH             (CCL_SEQCTRL_SEQSEL0_LATCH_Val << CCL_SEQCTRL_SEQSEL0_Pos) /* (CCL_SEQCTRL) D latch Position */
#define CCL_SEQCTRL_SEQSEL0_RS                (CCL_SEQCTRL_SEQSEL0_RS_Val << CCL_SEQCTRL_SEQSEL0_Pos) /* (CCL_SEQCTRL) RS latch Position */
#define CCL_SEQCTRL_SEQSEL1_Pos               _UINT32_(8)                                          /* (CCL_SEQCTRL) Sequential Selection 1 Position */
#define CCL_SEQCTRL_SEQSEL1_Msk               (_UINT32_(0xF) << CCL_SEQCTRL_SEQSEL1_Pos)           /* (CCL_SEQCTRL) Sequential Selection 1 Mask */
#define CCL_SEQCTRL_SEQSEL1(value)            (CCL_SEQCTRL_SEQSEL1_Msk & (_UINT32_(value) << CCL_SEQCTRL_SEQSEL1_Pos)) /* Assignment of value for SEQSEL1 in the CCL_SEQCTRL register */
#define   CCL_SEQCTRL_SEQSEL1_DISABLE_Val     _UINT32_(0x0)                                        /* (CCL_SEQCTRL) Sequential logic is disabled  */
#define   CCL_SEQCTRL_SEQSEL1_DFF_Val         _UINT32_(0x1)                                        /* (CCL_SEQCTRL) D flip-flop  */
#define   CCL_SEQCTRL_SEQSEL1_JK_Val          _UINT32_(0x2)                                        /* (CCL_SEQCTRL) JK flip-flop  */
#define   CCL_SEQCTRL_SEQSEL1_LATCH_Val       _UINT32_(0x3)                                        /* (CCL_SEQCTRL) D latch  */
#define   CCL_SEQCTRL_SEQSEL1_RS_Val          _UINT32_(0x4)                                        /* (CCL_SEQCTRL) RS latch  */
#define CCL_SEQCTRL_SEQSEL1_DISABLE           (CCL_SEQCTRL_SEQSEL1_DISABLE_Val << CCL_SEQCTRL_SEQSEL1_Pos) /* (CCL_SEQCTRL) Sequential logic is disabled Position */
#define CCL_SEQCTRL_SEQSEL1_DFF               (CCL_SEQCTRL_SEQSEL1_DFF_Val << CCL_SEQCTRL_SEQSEL1_Pos) /* (CCL_SEQCTRL) D flip-flop Position */
#define CCL_SEQCTRL_SEQSEL1_JK                (CCL_SEQCTRL_SEQSEL1_JK_Val << CCL_SEQCTRL_SEQSEL1_Pos) /* (CCL_SEQCTRL) JK flip-flop Position */
#define CCL_SEQCTRL_SEQSEL1_LATCH             (CCL_SEQCTRL_SEQSEL1_LATCH_Val << CCL_SEQCTRL_SEQSEL1_Pos) /* (CCL_SEQCTRL) D latch Position */
#define CCL_SEQCTRL_SEQSEL1_RS                (CCL_SEQCTRL_SEQSEL1_RS_Val << CCL_SEQCTRL_SEQSEL1_Pos) /* (CCL_SEQCTRL) RS latch Position */
#define CCL_SEQCTRL_Msk                       _UINT32_(0x00000F0F)                                 /* (CCL_SEQCTRL) Register Mask  */


/* -------- CCL_LUTCTRL : (CCL Offset: 0x08) (R/W 32) LUT Control # -------- */
#define CCL_LUTCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (CCL_LUTCTRL) LUT Control #  Reset Value */

