vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/ccl.h
#define CCL_WPCTRL_WPEN_Pos                   _UINT32_(0)                                          /* (CCL_WPCTRL) Write Protection Enable Position */
#define CCL_WPCTRL_WPEN_Msk                   (_UINT32_(0x1) << CCL_WPCTRL_WPEN_Pos)               /* (CCL_WPCTRL) Write Protection Enable Mask */
#define CCL_WPCTRL_WPEN(value)                (CCL_WPCTRL_WPEN_Msk & (_UINT32_(value) << CCL_WPCTRL_WPEN_Pos)) /* Assignment of value for WPEN in the CCL_WPCTRL register */
#define CCL_WPCTRL_WPLCK_Pos                  _UINT32_(1)                                          /* (CCL_WPCTRL) Write Protection Lock Position */
#define CCL_WPCTRL_WPLCK_Msk                  (_UINT32_(0x1) << CCL_WPCTRL_WPLCK_Pos)              /* (CCL_WPCTRL) Write Protection Lock Mask */
#define CCL_WPCTRL_WPLCK(value)               (CCL_WPCTRL_WPLCK_Msk & (_UINT32_(value) << CCL_WPCTRL_WPLCK_Pos)) /* Assignment of value for WPLCK in the CCL_WPCTRL register */
#define CCL_WPCTRL_WPKEY_Pos                  _UINT32_(8)                                          /* (CCL_WPCTRL) Write Protection Key Position */
#define CCL_WPCTRL_WPKEY_Msk                  (_UINT32_(0xFFFFFF) << CCL_WPCTRL_WPKEY_Pos)         /* (CCL_WPCTRL) Write Protection Key Mask */
#define CCL_WPCTRL_WPKEY(value)               (CCL_WPCTRL_WPKEY_Msk & (_UINT32_(value) << CCL_WPCTRL_WPKEY_Pos)) /* Assignment of value for WPKEY in the CCL_WPCTRL register */
#define   CCL_WPCTRL_WPKEY_KEY_Val            _UINT32_(0x43434C)                                   /* (CCL_WPCTRL) Allow writes to the WPCTRL register  */
#define CCL_WPCTRL_WPKEY_KEY                  (CCL_WPCTRL_WPKEY_KEY_Val << CCL_WPCTRL_WPKEY_Pos)   /* (CCL_WPCTRL) Allow writes to the WPCTRL register Position */
#define CCL_WPCTRL_Msk                        _UINT32_(0xFFFFFF03)                                 /* (CCL_WPCTRL) Register Mask  */


/* CCL register offsets definitions */
#define CCL_CTRLA_REG_OFST             _UINT32_(0x00)      /* (CCL_CTRLA) Control A Offset */
#define CCL_SEQCTRL_REG_OFST           _UINT32_(0x04)      /* (CCL_SEQCTRL) Sequential Control Offset */
#define CCL_LUTCTRL_REG_OFST           _UINT32_(0x08)      /* (CCL_LUTCTRL) LUT Control # Offset */
#define CCL_LUTCTRL0_REG_OFST          _UINT32_(0x08)      /* (CCL_LUTCTRL0) LUT Control # Offset */
#define CCL_LUTCTRL1_REG_OFST          _UINT32_(0x0C)      /* (CCL_LUTCTRL1) LUT Control # Offset */
#define CCL_LUTCTRL2_REG_OFST          _UINT32_(0x10)      /* (CCL_LUTCTRL2) LUT Control # Offset */
#define CCL_LUTCTRL3_REG_OFST          _UINT32_(0x14)      /* (CCL_LUTCTRL3) LUT Control # Offset */
#define CCL_WPCTRL_REG_OFST            _UINT32_(0x28)      /* (CCL_WPCTRL) Write Protection Control Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* CCL register API structure */
typedef struct
{  /* Configurable Custom Logic */
  __IO  uint32_t                       CCL_CTRLA;          /* Offset: 0x00 (R/W  32) Control A */
  __IO  uint32_t                       CCL_SEQCTRL;        /* Offset: 0x04 (R/W  32) Sequential Control */
  __IO  uint32_t                       CCL_LUTCTRL[4];     /* Offset: 0x08 (R/W  32) LUT Control # */
  __I   uint8_t                        Reserved1[0x10];
  __IO  uint32_t                       CCL_WPCTRL;         /* Offset: 0x28 (R/W  32) Write Protection Control */
} ccl_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMPL10_CCL_COMPONENT_H_ */
